younis1431996/ATMEGA32_drv/ATmega32_D1_GPIO/drv/GPIO/ATmega32_GPIO_ID.h
/*
 * ATmega32_GPIO_ID.h
 *
 *  Created on: Nov 22, 2022
 *      Author: Mahmoud_Mohamed
 */

#ifndef DRV_ATMEGA32_GPIO_ID_H_
#define DRV_ATMEGA32_GPIO_ID_H_

#include <stdint.h>

//$$ PORTA
#define GPIO_PA0		0U		//PA0
#define GPIO_PA1		1U		//PA1
#define GPIO_PA2		2U		//PA2
#define GPIO_PA3		3U		//PA3
#define GPIO_PA4		4U		//PA4
#define GPIO_PA5		5U		//PA5
#define GPIO_PA6		6U		//PA6
#define GPIO_PA7		7U  	//PA7

// $$ PORTB
#define GPIO_PB0		8U		//PB0
#define GPIO_PB1		9U		//PB1
#define GPIO_PB2		10U		//PB2
#define GPIO_PB3		11U		//PB3
#define GPIO_PB4		12U		//PB4
#define GPIO_PB5		13U		//PB5
#define GPIO_PB6		14U		//PB6
#define GPIO_PB7		15U		//PB7

// $$ PORTC
#define GPIO_PC0		16U		//PC0
#define GPIO_PC1		17U		//PC1
#define GPIO_PC2		18U		//PC2
#define GPIO_PC3		19U		//PC3
#define GPIO_PC4		20U		//PC4
#define GPIO_PC5		21U		//PC5
#define GPIO_PC6		22U		//PC6
#define GPIO_PC7		23U		//PC7

// $$ PORTD
#define GPIO_PD0		24U		//PD0
#define GPIO_PD1		25U		//PD1
#define GPIO_PD2		26U		//PD2
#define GPIO_PD3		27U		//PD3
#define GPIO_PD4		28U		//PD4
#define GPIO_PD5		29U		//PD5
#define GPIO_PD6		30U		//PD6
#define GPIO_PD7		31U		//PD7

#endif /* DRV_ATMEGA32_GPIO_ID_H_ */
